app/views/jobs/_user_job_fields.html.erb

	<%= f.hidden_field :requirement_id, value: 2 %>
	<!-- <span><%= f.collection_select :user_id, User.all, :id, :name, prompt: true %></span> -->
---
SELECT `users`.* FROM `users`