app/views/users/show.html.erb

<h1><%= @user.name %> <%= @user.surname %></h1><hr>
<% if @user.user_jobs.any? %>
---
SELECT "user_jobs".* FROM "user_jobs" WHERE "user_jobs"."user_id" = ?  [["user_id", 1]]