app/views/results/show.html.erb

SELECT "user_jobs".* FROM "user_jobs" WHERE "user_jobs"."result_id" = ?  [["result_id", 1]]
---
  <tbody>
    <% @result.user_jobs.each do |user_job| %>