app/controllers/home_controller.rb

SELECT  DISTINCT `users`.* FROM `users` WHERE (`users`.`name` LIKE '%Sava%') LIMIT 5
---
  def search
    @users = User.ransack(name_cont: params[:q]).result(distinct: true)
    @jobs = Job.ransack(job_name_cont: params[:q]).result(distinct: true)

    respond_to do |format|
      format.html {}
      format.json {
        @users = @users.limit(5)