app/controllers/jobs_controller.rb

INSERT INTO `user_jobs` (`user_id`, `job_id`, `result_id`, `applied`, `interview`, `shortlist`, `final`, `reason`, `created_at`, `updated_at`) VALUES (1, 1, 1, 1, 0, 0, 0, '', '2017-08-22 12:24:39', '2017-08-22 12:24:39')
---
  def create
    @job = Job.new(job_params)

    respond_to do |format|
      if @job.save

UPDATE `user_jobs` SET `requirement_id` = 2, `updated_at` = '2017-08-23 14:25:47' WHERE `user_jobs`.`id` = 1
---
  def update
    respond_to do |format|
      if @job.update(job_params)

DELETE FROM "user_jobs" WHERE "user_jobs"."id" = ?  [["id", 2]]
---
  def destroy
    @job.destroy

SELECT "user_jobs".* FROM "user_jobs" WHERE "user_jobs"."job_id" = ? AND "user_jobs"."id" = 1  [["job_id", 1]]
---
    def set_job
      @job = Job.find(params[:id])