app/controllers/requirements_controller.rb

  def index
    @requirements = Requirement.all
---
SELECT `requirements`.* FROM `requirements`

  def create
    @requirement = Requirement.new(requirement_params)

    respond_to do |format|
      if @requirement.save
---
INSERT INTO "requirements" ("requirement", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["requirement", "requirement aaaaaaa"], ["job_id", 1], ["created_at", "2017-08-21 12:30:43.939585"], ["updated_at", "2017-08-21 12:30:43.939585"]]

    def set_requirement
      @requirement = Requirement.find(params[:id])
---
SELECT  "requirements".* FROM "requirements" WHERE "requirements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]