app/controllers/results_controller.rb

  def index
    @results = Result.all
---
SELECT `results`.* FROM `results`

    def set_result
      @result = Result.find(params[:id])
---
SELECT  "results".* FROM "results" WHERE "results"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]