app/controllers/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page], :per_page => 12).order('name ASC')
---
SELECT  `users`.* FROM `users` ORDER BY name ASC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM `users`