app/controllers/user_jobs_controller.rb

SELECT `user_jobs`.* FROM `user_jobs`
---
  def index
    @user_jobs = UserJob.all

INSERT INTO "user_jobs" ("user_id", "job_id", "result_id", "requirement_id", "applied", "interview", "shortlist", "final", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user_job = UserJob.new(user_job_params)

    respond_to do |format|
      if @user_job.save

UPDATE `user_jobs` SET `result_id` = 2, `requirement_id` = NULL, `applied` = 1, `interview` = 1, `shortlist` = 1, `final` = 1, `reason` = '', `updated_at` = '2017-08-23 14:27:50' WHERE `user_jobs`.`id` = 1
---
  def update
    respond_to do |format|
      if @user_job.update(user_job_params)

SELECT  "user_jobs".* FROM "user_jobs" WHERE "user_jobs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_user_job
      @user_job = UserJob.find(params[:id])